In [1]:
import pandas as pd
import dask.dataframe as dd
import numpy as np

In [2]:
s = pd.Series(range(5))  
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

where(cond, other=nan)
Replace values where the condition is False.
바꾼다 값을 NaN으로 , 조건이 false인 곳

Return an object of same shape as self.

In [3]:
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [4]:
s.mask(s > 0)

0    0.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [5]:
s.where(s > 1)

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64

In [12]:
s.where(s > 1, 10)

0    10
1    10
2     2
3     3
4     4
dtype: int64

In [17]:
tt = np.arange(10)

In [18]:
tt

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [15]:
df = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])

In [16]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [19]:
m = df % 3 == 0  
m

       A      B
0   True  False
1  False   True
2  False  False
3   True  False
4  False   True

### False인 애들에 -를 붙혔다

In [21]:
tt = df.where(m, -df) 
tt

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9